openfoam9/tutorials/multiphase/multiphaseEulerFoam/RAS/wallBoilingIATE/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication extrudeMesh
runApplication decomposePar

runParallel $(getApplication)

if ! isTest "$@"
then
    runApplication -a foamDictionary system/controlDict -entry endTime -set 4
    runApplication -a foamDictionary system/controlDict -entry startTime -set 0.5
    runParallel -a foamDictionary 0.5/T.liquid -entry boundaryField/wall/q -set "uniform 73890"
    runParallel -a foamDictionary 0.5/U.liquid -entry boundaryField/inlet/type -set "fixedValue"
    runParallel -a $(getApplication)
fi

runApplication reconstructPar -latestTime
runApplication postProcess -latestTime -func "
    graphCell
    (
        funcName=graph,
        start=(3.4901 0 0),
        end=(3.4901 0.0096 0),
        fields=(alpha.gas T.liquid T.gas d.gas)
    )"

./validation/createGraphs

#------------------------------------------------------------------------------
